app/Controllers/Dapur/Permintaan.php

    public function index()
    {
        // 1. Pengecekan Akses (Sangat Penting)
        if (!session()->get('logged_in') || session()->get('role') !== 'dapur') {
            return redirect()->to('/login');
        }

        // 2. Inisialisasi Model Permintaan (PERBAIKAN di sini)
        $permintaanModel = new PermintaanModel();

        // 3. Ambil data permintaan berdasarkan ID pemohon
        $data['permintaan'] = $permintaanModel
                                    ->where('pemohon_id', session()->get('user_id'))
                                    ->orderBy('created_at', 'DESC') // Urutkan dari yang terbaru
                                    ->findAll();
---
SELECT *
FROM `permintaan`
WHERE `pemohon_id` = '10'
ORDER BY `created_at` DESC