app/Controllers/Dapur/StatusPermintaan.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('role') !== 'dapur') {
            return redirect()->to('/login');
        }

        $pemohonId = session()->get('id') ?? session()->get('user_id');

        $data['list_permintaan'] = $this->permintaanModel
                                        ->where('pemohon_id', $pemohonId)
                                        ->orderBy('created_at', 'DESC')
                                        ->findAll();
---
SELECT *
FROM `permintaan`
WHERE `pemohon_id` = '10'
ORDER BY `created_at` DESC

    public function detail($id)
    {
        if (!session()->get('logged_in') || session()->get('role') !== 'dapur') {
            return redirect()->to('/login');
        }

        $pemohonId = session()->get('id') ?? session()->get('user_id');

        $data['permintaan'] = $this->permintaanModel
                                   ->where('id', $id)
                                   ->where('pemohon_id', $pemohonId)
                                   ->first();
---
SELECT *
FROM `permintaan`
WHERE `id` = '9'
AND `pemohon_id` = '10'
 LIMIT 1