app/Controllers/Admin/BahanBaku.php

    public function index()
    {
        // 1. Pengecekan Akses
        if (!session()->get('logged_in') || session()->get('role') !== 'gudang') {
            return redirect()->to('/login');
        }

        // 2. Ambil semua data bahan baku dari Model
        $data['bahan_baku'] = $this->bahanModel->orderBy('tanggal_kadaluarsa', 'ASC')->findAll();
---
SELECT *
FROM `bahan_baku`
ORDER BY `tanggal_kadaluarsa` ASC