app/Controllers/admin/Students.php

SELECT `students`.`student_id`, `students`.`entry_year`, `users`.`username`, `users`.`full_name`
FROM `students`
JOIN `users` ON `users`.`user_id` = `students`.`user_id`
---
    public function index()
    {
    if (!session()->get('logged_in')) {
        return redirect()->to('/login');
    }


        $db = \Config\Database::connect();
        $builder = $db->table('students');
        $builder->select('students.student_id, students.entry_year, users.username, users.full_name');
        $builder->join('users', 'users.user_id = students.user_id');
        $students = $builder->get()->getResultArray();

INSERT INTO `users` (`username`, `password`, `role`, `full_name`) VALUES ('ilham', '$2y$10$QjEYUZbbWMQzEKS1ufAABegjeL35YnBYfmi6q0zBS/FzoOZRaRMxm', 'student', 'ilham sehat')
INSERT INTO `students` (`user_id`, `entry_year`) VALUES (15, '2023')
---
    public function save()
    {
        $userModel = new UserModel();
        $studentModel = new StudentModel();

    $userData = [
        'username'  => $this->request->getPost('username'),
        'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        'role'      => 'student',
        'full_name' => $this->request->getPost('full_name')
    ];
    $user_id = $userModel->insert($userData);

    $studentModel->insert([
        'user_id'    => $user_id,
        'entry_year' => $this->request->getPost('entry_year')
    ]);

SELECT *
FROM `students`
WHERE `students`.`student_id` = '6'
DELETE FROM `students`
WHERE `student_id` IN ('6')
DELETE FROM `users`
WHERE `user_id` IN ('15')
---
    public function delete($student_id)
    {
        try {
            $studentModel = new \App\Models\StudentModel();
            $userModel = new \App\Models\UserModel();

            $student = $studentModel->find($student_id);

            if ($student) {
                $user_id = $student['user_id'];
                $studentModel->delete($student_id);
                $userModel->delete($user_id);