app/Controllers/dashboard.php

SELECT *
FROM `courses`
SELECT `students`.`student_id`, `students`.`entry_year`, `users`.`username`, `users`.`full_name`
FROM `students`
JOIN `users` ON `users`.`user_id` = `students`.`user_id`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $courseModel = new CourseModel();
        $db = \Config\Database::connect();

        $courses = $courseModel->findAll();

        // Join students dan users
        $builder = $db->table('students');
        $builder->select('students.student_id, students.entry_year, users.username, users.full_name');
        $builder->join('users', 'users.user_id = students.user_id');
        $students = $builder->get()->getResultArray();