app/Controllers/login.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();

        if ($user) {
            $pass = $user['password'];
            if (password_verify($password, $pass)) {
                $ses_data = [
                    'user_id'   => $user['user_id'],
                    'username'  => $user['username'],
                    'full_name' => $user['full_name'],
                    'role'      => $user['role'],
                    'logged_in' => TRUE
                ];
                $user_id = $user['user_id']; // dari tabel users
                $studentModel = new \App\Models\StudentModel();
                $student = $studentModel->where('user_id', $user_id)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'panji'
 LIMIT 1
SELECT *
FROM `students`
WHERE `user_id` = '7'
 LIMIT 1