app/Models/PermintaanModel.php

SELECT `permintaan`.*, `user`.`name` AS `pemohon_nama`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
WHERE `permintaan`.`status` = 'menunggu'
ORDER BY `permintaan`.`created_at` DESC
---
    public function getPermintaanForGudang($status = null, $id = null)
{
    $builder = $this->select('permintaan.*, user.name AS pemohon_nama')
                     ->join('user', 'user.id = permintaan.pemohon_id');

    if ($status !== null) {
        $builder->where('permintaan.status', $status);
    }

    if ($id !== null) {
        $builder->where('permintaan.id', $id);
        return $builder->first();
    }

    return $builder->orderBy('permintaan.created_at', 'DESC')->findAll();