app/Models/PermintaanDetailModel.php

    public function getDetailWithBahanNama($permintaanId)
    {
        return $this->select('permintaan_detail.*, bahan_baku.nama AS nama_bahan, bahan_baku.satuan')
                    ->join('bahan_baku', 'bahan_baku.id = permintaan_detail.bahan_id')
                    ->where('permintaan_detail.permintaan_id', $permintaanId)
                    ->findAll();
---
SELECT `permintaan_detail`.*, `bahan_baku`.`nama` AS `nama_bahan`, `bahan_baku`.`satuan`
FROM `permintaan_detail`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `permintaan_detail`.`bahan_id`
WHERE `permintaan_detail`.`permintaan_id` = '9'